public class UnderDevelop {
    /*

                    TO     DO
                    1.چک کردن exceptions
                    در ایجاد معاون شعبه
            Bank
                fields

                done • لیست شعب بانک
                done• لیست کارمندان بانک
                done• لیست مشتریان بانک

                methods

                done• ایجاد شعبه
                done• اضافهکردن کارمند به بانک
                • نمایش لیست شعب و کارمندان هر شعبهdone
                done• نمایش لیست مشتریان


            Person
                fields

                done• نام
                • نام خانوادگیdone
                • تاریخ تولدdone
                • کد ملی 10رقمی – یکتا باشدdone
                done• آدرس
                • شماره تلفن همراه 11 رقمی شروع با 0 - یکتا باشدdone


            Customer
                fields

                • شناسه کاربری یکتا باشندdone
                • لیست حسابهای کاربر حسابها معتبر باشندdone
                • صندوق پیامهاdone

                methods

                • ساخت حساب برای ساخت حساب مشتری باید نام، نامخانوادگی، تاریخ تولد، کدملی، آدرس،done
                 تلفن، نوع حساب درخواستی خود را ارسال کند.

                • بستن حساب مشتری درخواست خود جهت حذف حساب را برای شعبه ارسال میکند و پسdone
                از تایید تحویلدار حساب بسته میشود. در این زمان باید در صندوق پیامهای مشتری یک درخواست درحال پیگیری وجود داشتهباشد و همچنین درخواست در صندوق پیامهای
                تحویلداری ایجاد شود که تعداد درخواستهای کمتری دارد.

                • مشاهدهی لیست حسابها و اطالعات آنهاdone

                • مشاهده گزارشهای مربوط به وامها درصورت وجود و قسطهای مربوطه و...done

                • جستوجوی حسابdone

                • وام گرفتنروند گرفتن وام به این صورت است که مشتری درخواست دریافت وام را به تحویلدارdone
                ارسال میکندیعنی در صندوق پیامهای مشتری یک گزارش درحال پیگیری بدون پاسخ
                وجود دارد و در صندوق پیامهای تحویلدار یک درخواست برای رسیدگی ایجاد میشود پس از
                تایید اطالعات مشتری این درخواست به معاون شعبه ارسال میشود و ادامه سلسله مراتب را
                طی میکند ، در این سلسله مراتب باید وضعیت درخواست و صندوق پیامهای هریک از افراد به
                طور دقیق مدیریت و بروزرسانی شود.


            Employee
                fields

                done• شماره کارمندی
                • حقوق ماهیانهdone
                • شعبه محل کارdone
                done• صندوق پیام

                methods

                done• دریافت سابقه بانکی واطالعات مربوط به مشتریان
                done• رسیدگی به درخواستهای بانکی مشتریان


            Branch
                fields

                • شماره شعبه یکتا باشد
                • رئیس شعبهdone
                done• معاون شعبه
                done• لیست تحویلداران
                done• لیست حسابهای بازشده در شعبه

                methods

                • نمایش لیست مشتریان شعبهdone
                • اضافه کردن کارمند به شعبه فقط با درخواست رئیس شعبه درصورتی که شخص دیگری اینdone
                درخواست را ارسال کند باید پیغام مناسبی دریافت کنددرخواستش رد شود.
                • حذف کردن کارمند از شعبه فقط با درخواست رئیس شعبه درصورتی که شخص دیگری این
                درخواست را ارسال کند باید پیغام مناسبی دریافت کنددرخواستش رد شود.
                • جستوجوی کارمند در شعبه


            Branch Manager
                fields
                done• حقوق ماهیانه: دوبرابر حقوق کارمند عادی تحویلدار

                methods

                • دریافت لیست کارمندان شعبه
                • بستن حساب مشتری
                done• تایید درخواستهای بانکی: رئیس شعبه پس از تایید معاون شعبه، چک میکند که موجودی
                بانک موجودی کل حسابهای مشتریان بیشتر از مبلغ درخواستی وام باشد، همچنین مبلغ
                وام از سقف 1,000,000,000 تومان برای وام عادی، و سقف 500,000,000 برای وام تسهیالت
                تجاوز نکند.


            Assistant Manager
                fields
                done• حقوق ماهیانه: 1.5 برابر کارمند عادی)تحویلدار(

                methods
                done• تایید درخواستهای بانکی: کار معاون شعبه پس از تایید تحویلدار برای درخواست وام این
                است که چک کند که هیچکدام از حسابهای مشتری وام جاری نداشتهباشد. معاون پس از
                تایید تحویلدار و چک کردن این قانون، درخواست وام مشتری را جهت تایید نهایی به رئیس
                شعبه ارجاع میدهد.


            Teller
                fields
                • حقوق ماهیانه: حقوق کارمند عادیdone

                methods
                done• تایید درخواستهای بانکی: مشتری ابتدا درخواست بانکی خود)شامل وام و حذف حساب( را
                برای تحویلدار ارسال میکند. برای هر کدام از درخواستها، تحویلدار موارد زیر را چک میکند:
                o وام: تحویلدار اطالعات مشتری را دریافت و پس از انجام احراز هویت، درخواست وام
                مشتری را به معاون شعبه ارجاع میدهد.o حذف حساب: حسابی که مشتری درخواست حذف آن را دارد، نباید وام جاری
                داشتهباشد. اگر وام جاری نداشت، حساب حذف شود


            Account
                fields
                • شماره حساب)13 رقمی – یکتا باشد(done
                • موجودی حساب)عدد صحیح مثبت(done

                methods
                • واریز کردن)حساب به حساب/پرداخت قسط وام جاری(:0باید هر دوحساب مشتری و دریافت
                کننده معتبر باشند و موجودی مشتری کافی باشد.

                done• موجودی گرفتن)به ازای هر موجودی مبلغ 1,000 تومان ازحساب کسر شود.
                • پول گذاشتن در حسابdone
                • برداشت پول از حسابdone


            Base Loan
                fields
                done• مقدار وام)عدد صحیح مثبت(
                • مدت زمان پرداخت وام)عدد صحیح مثبت(done
                • سهم دولت)عددی بین 0 تا 100(done
                • سهم مشتری)عددی بین 0 تا 100(done
                • وجه التزام)عددی بین 0 تا 100(done
                • گیرنده وام)مشتری معتبر(done


   */
}
