public class UnderDevelop {
    /*
    1_ We have four interfaces :
                Displayable -> used in -> bank, branch, customer ,employee
                Loanable -> used in customer
                Payable -> used in customer
                RequestHandler -> used in -> AssistantManager, BranchManager, Teller.


                عملیات هایی که تکمیل نشده
                1برداشت وجه   done
                2واریز وجه   done
                done   3 انتقال پول بین حساب ها
                4 مدیریت صندوق پیام ها
                5 تایید سلسله مراتبی ( که فعلا همینطوری تایید میشه ولی در واق نباید اینطوری باشه )



                قوانین تکمیل نشده :
                یکتا کردن شماره ها   done

                پیاده سازی فرم درخواست

                ارسال درخواست برای تحویل داری که تعداد درخواست کمتری دارد

                پیاده سازی یک متد (برای تایید درخواست ) برای هر کلاس فرزند متفاوت است اصول طراحی شی گرا رعایت شود





در کلاس ها:
                 Person
                 done  برسی یکتایی کد ملی و 10 رقمی بودن
                 برسی یکتایی شماره تلفن و 11 رقمی بودن  done

                 Customer
                 done  یکتایی شناسه کاربری
                 بستن حساب
                 )مشتری درخواست خود جهت حذف حساب را برای شعبه ارسال میکند و پس
از تایید تحویلدار حساب بسته میشود. در این زمان باید در صندوق پیامهای مشتری یک

• مشاهدهی لیست حسابها و اطالعات آنها
• مشاهده گزارشهای مربوط به وامها درصورت وجود و قسطهای مربوطه و..



                Employee

                Branch
                یکتا بودن شماره شعبه  done
                اضافه کردن کارمند به شعبه)فقط با درخواست رئیس شعبه( درصورتی که شخص دیگری این
درخواست را ارسال کند باید پیغام مناسبی دریافت کند)درخواستش رد شود(.
                و حذف کردن با همین شرایط
                جستجو کارمند در شعبه

                BranchManager
                حقوق ماهیانه دوبرابر تحویلدار

                دریافت لیست از کارمندان
                بستن حساب مشتری
                تایید درخواست های بانکی (حنما فایل پروژه چک شود)


                AssistantManager
                حقوق ماهیانه 1.5 برابر کارمند عادی
                 تایید درخواست های بانکی (حنما فایل پروژه چک شود

                Teller
                حقوق کارمند عادی
                 تایید درخواست های بانکی (حنما فایل پروژه چک شود)
                حذف حساب


                Account
                done  شماره حساب یکتا 13 رقمی
                done  موجودی حساب مثبت
                واریز کردن حساب به حساب  done
                موجودی گرفتن ( وکسر مبلغی بخاطر آن)  done
                واریز و برداشت پول به حساب

                 
                 done و انواع حساب
                 جاری
                 کوتاه مدت done
                 done  قرض الپسنده

                BaseLoan
                done مقدار وام عدد صحیح مثبت
                مدت زمان (عددی بین 0 تا 100) done
                سهم مشتری (عددی بین 0 تا 100) done
                وجه التزام (عددی بین 0 تا 100) done
                     گیرنده
     */
}
